; domain
(define (domain spanner)                    
(:requirements :typing :strips :constraints)      

(:types 
	location locatable - object
	man nut spanner - locatable	
)                                           
                                                                               
(:predicates 
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(useable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))                                                                                           
(:action walk 
        :parameters (?start - location ?end - location ?m - man)
        :precondition (and (at ?m ?start) 
                           (link ?start ?end))                                                          
        :effect (and (not (at ?m ?start)) (at ?m ?end)))

(:action pickup_spanner 
        :parameters (?l - location ?s - spanner ?m - man)
        :precondition (and (at ?m ?l) 
                           (at ?s ?l))
        :effect (and (not (at ?s ?l))
                     (carrying ?m ?s)))

(:action tighten_nut 
        :parameters (?l - location ?s - spanner ?m - man ?n - nut)
        :precondition (and (at ?m ?l) 
		      	   (at ?n ?l)
			   (carrying ?m ?s)
			   (useable ?s)
			   (loose ?n))
        :effect (and (not (loose ?n))(not (useable ?s)) (tightened ?n)))
)

; problem
; params: python3 /home/jfan5/Safety-gen/pddl3/spanner/spanner-generator.py 5 5 7 --seed 1554975522 --problem-name spanner-s5-n5-l7-s1554975522
(define (problem spanner-s5-n5-l7-s1554975522)
 (:domain spanner)
 (:objects 
     bob - man
     spanner1 spanner2 spanner3 spanner4 spanner5 - spanner
     nut1 nut2 nut3 nut4 nut5 - nut
     location1 location2 location3 location4 location5 location6 location7 - location
     shed gate - location
    )
 (:init 
    (at bob shed)
    (at spanner1 location6)
    (useable spanner1)
    (at spanner2 location5)
    (useable spanner2)
    (at spanner3 location6)
    (useable spanner3)
    (at spanner4 location6)
    (useable spanner4)
    (at spanner5 location6)
    (useable spanner5)
    (loose nut1)
    (at nut1 gate)
    (loose nut2)
    (at nut2 gate)
    (loose nut3)
    (at nut3 gate)
    (loose nut4)
    (at nut4 gate)
    (loose nut5)
    (at nut5 gate)
    (link shed location1)
    (link location7 gate)
    (link location1 location2)
    (link location2 location3)
    (link location3 location4)
    (link location4 location5)
    (link location5 location6)
    (link location6 location7)
)
 (:goal
  (and
   (tightened nut1)
   (tightened nut2)
   (tightened nut3)
   (tightened nut4)
   (tightened nut5)
)))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 5
2. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 5
3. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 5
4. (walk location3 location4 bob)
   deleted: (at bob location3)
   added: (at bob location4)
   goals met: 0 of 5
5. (walk location4 location5 bob)
   deleted: (at bob location4)
   added: (at bob location5)
   goals met: 0 of 5
6. (pickup_spanner location5 spanner2 bob)
   deleted: (at spanner2 location5)
   added: (carrying bob spanner2)
   goals met: 0 of 5
7. (walk location5 location6 bob)
   deleted: (at bob location5)
   added: (at bob location6)
   goals met: 0 of 5
8. (pickup_spanner location6 spanner1 bob)
   deleted: (at spanner1 location6)
   added: (carrying bob spanner1)
   goals met: 0 of 5
9. (pickup_spanner location6 spanner3 bob)
   deleted: (at spanner3 location6)
   added: (carrying bob spanner3)
   goals met: 0 of 5
10. (pickup_spanner location6 spanner4 bob)
   deleted: (at spanner4 location6)
   added: (carrying bob spanner4)
   goals met: 0 of 5
11. (pickup_spanner location6 spanner5 bob)
   deleted: (at spanner5 location6)
   added: (carrying bob spanner5)
   goals met: 0 of 5
12. (walk location6 location7 bob)
   deleted: (at bob location6)
   added: (at bob location7)
   goals met: 0 of 5
13. (walk location7 gate bob)
   deleted: (at bob location7)
   added: (at bob gate)
   goals met: 0 of 5
14. (tighten_nut gate spanner5 bob nut1)
   deleted: (loose nut1) (useable spanner5)
   added: (tightened nut1)
   goals met: 1 of 5
15. (tighten_nut gate spanner1 bob nut5)
   deleted: (loose nut5) (useable spanner1)
   added: (tightened nut5)
   goals met: 2 of 5
16. (tighten_nut gate spanner2 bob nut4)
   deleted: (loose nut4) (useable spanner2)
   added: (tightened nut4)
   goals met: 3 of 5
17. (tighten_nut gate spanner3 bob nut3)
   deleted: (loose nut3) (useable spanner3)
   added: (tightened nut3)
   goals met: 4 of 5
18. (tighten_nut gate spanner4 bob nut2)
   deleted: (loose nut2) (useable spanner4)
   added: (tightened nut2)
   goals met: 5 of 5
